[
  {
    "Name": "Castle",
    "ReleaseYear": 2009,
    "Genre": "Detective, comedy, drama",
    "Directors": "Rob Bowman, John Terlesky, Bill Roe",
    "Countries": "USA",
    "Actors": [
      "Nathan Fillion - Richard Castle",
      "Stana Katic - Kate Beckett",
      "Susan Sullivan - Martha Rodgers",
      "Jon Huertas - Javier Esposito",
      "Seamus Dever - Kevin Ryan",
      "Molly C. Quinn - Alexis Castle",
      "Tamala Jones - Lanie Parish",
      "Penny Johnson Jerald - Captian Victoria Gates",
      "Ruben Santiago-Hudson - Captian Roy Mantgomery"
    ],
    "Description": "After a serial killer imitates the plots of his novels, successful mystery novelist Richard Castle receives permission from the Mayor of New York City to tag along with an NYPD homicide investigation team for research purposes.",
    "Id": 0,
    "EndYear": 2016,
    "IsEnded": true,
    "NumberOfSeasons": 8,
    "Episodes": [
      {
        "EpisodeId": 0,
        "SeasonNumber": 1,
        "EpisodeNumber": 1,
        "Name": "Flowers for Your Grave",
        "Description": ""
      },
      {
        "EpisodeId": 1,
        "SeasonNumber": 1,
        "EpisodeNumber": 2,
        "Name": "Nanny McDead",
        "Description": ""
      },
      {
        "EpisodeId": 2,
        "SeasonNumber": 1,
        "EpisodeNumber": 3,
        "Name": "Hedge Fund Homeboys",
        "Description": ""
      },
      {
        "EpisodeId": 3,
        "SeasonNumber": 1,
        "EpisodeNumber": 4,
        "Name": "Hell Hath No Fury",
        "Description": ""
      },
      {
        "EpisodeId": 4,
        "SeasonNumber": 1,
        "EpisodeNumber": 5,
        "Name": "A Chill Goes Through Her Veins",
        "Description": ""

      },
      {
        "EpisodeId": 5,
        "SeasonNumber": 1,
        "EpisodeNumber": 6,
        "Name": "Always Buy Retail",
        "Description": ""
      },
      {
        "EpisodeId": 6,
        "SeasonNumber": 1,
        "EpisodeNumber": 7,
        "Name": "Home Is Where the Heart Stops",
        "Description": ""
      },
      {
        "EpisodeId": 7,
        "SeasonNumber": 1,
        "EpisodeNumber": 8,
        "Name": "Ghosts",
        "Description": ""
      },
      {
        "EpisodeId": 8,
        "SeasonNumber": 1,
        "EpisodeNumber": 9,
        "Name": "Little Girl Lost",
        "Description": ""
      },
      {
        "EpisodeId": 9,
        "SeasonNumber": 1,
        "EpisodeNumber": 10,
        "Name": "A Death in the Family",
        "Description": ""
      }
    ]
  },
  {
    "Name": "Sex education",
    "ReleaseYear": 2019,
    "Genre": "Comedy-drama",
    "Directors": "Ben Taylor, Kate Herron",
    "Countries": "United Kingdom",
    "Actors": [
      "Asa Butterfield - Otis Milburn",
      "Gillian Anderson - Dr Jean F. Milburn",
      "Ncuti Gatwa - Eric Effiong",
      "Emma Mackey - Maeve Wiley",
      "Connor Swindells - Adam Groff",
      "Kedar Williams-Stirling - Jackson Marchetti",
      "Alistair Petrie - Mr Groff"
    ],
    "Description": "Socially awkward teenager Otis Milburn is ambivalent about sex, despite, or perhaps because of, his mother being a sex therapist who is frank about all aspects of sexuality. After inadvertently assisting the school bully with his sexual performance anxiety, Otis sets up a sex advice business with Maeve—a confident but vulnerable classmate—to educate their fellow students in how to deal with their own sexual problems.",
    "Id": 1,
    "EndYear": null,
    "IsEnded": false,
    "NumberOfSeasons": 1,
    "Episodes": [
      {
        "EpisodeId": 0,
        "SeasonNumber": 1,
        "EpisodeNumber": 1,
        "Name": "Episode 1",
        "Description": "Otis, a sixth form student whose mother Jean is a sex therapist, struggles with his inability to masturbate. His best friend Eric, who is openly gay, informs him that everyone in their class has had sex over the summer, except Otis. Adam, the school bully and the son of the headmaster, is unable to orgasm after sex with his girlfriend Aimee. Aimee shares her troubles with Maeve, who has a reputation for being promiscuous. Adam and Otis are assigned partners; when Adam comes over to Otis's house, he discovers all of Jean's paraphernalia despite Otis's efforts to hide it. The next day, Adam tells everyone in class, causing an embarrassed Otis to rush out, with Maeve going after him. Later, they find Adam in an abandoned building, unable to calm down after having taken three Viagra pills. Adam explains his situation, and Otis gives him advice to own his narrative. The next day, Adam exposes himself in front of the entire cafeteria as a means of owning, his narrative. He is able to achieve orgasm with Aimee, but she dumps him as he is now an embarrassment. Maeve proposes to Otis that they run a sex therapy clinic at the school – with Maeve handling the logistics and Otis providing the therapy – and split the profits."
      },
      {
        "EpisodeId": 1,
        "SeasonNumber": 1,
        "EpisodeNumber": 2,
        "Name": "Episode 2",
        "Description": "Aimee hosts a house party where Otis and Maeve attempt to find clients by giving out free advice. Eric attempts to teach the girls how to properly perform fellatio, but while practising on bananas, one girl's gag reflex kicks in, leading to disaster. Otis locks himself in the bathroom with a couple who injured themselves during an attempt at sex, and provides valuable therapy. Adam breaks into the party and finds Aimee talking to another guy; he smashes a vase full of Aimee's grandmother's ashes into the new guy's head. Jean struggles with Otis being distant from her as he feels she is too intrusive. Maeve, who discovers that she is pregnant, has sex with Jackson to take her mind off things; but he wants a more concrete relationship with her. Dejected due to her pregnancy, she tells Otis she plans to call the sex therapy off. The next day, several students approach Otis for advice. Enlightened, he tells Maeve he intends to continue with the plan."
      },
      {
        "EpisodeId": 2,
        "SeasonNumber": 1,
        "EpisodeNumber": 3,
        "Name": "Episode 3",
        "Description": "Otis has a wet dream about Maeve and ejaculates, which he unsuccessfully tries to hide from Jean. It is discovered that Jackson consumes Risperidone At the abortion clinic, Maeve finds out that the clinic's policy requires someone to come pick her up; she asks Otis and he agrees, thinking it is a date. Eric is selected for the Swing Band, and clarinettist Lily offers to help him catch up to speed. At Eric's place, Lily tries to have sex with him, but they end up playing with makeup and watching gay porn once she discovers Eric is gay. Otis goes early to the clinic and gets kicked out; he offers relationship advice to a pro-life couple protesting outside the clinic. Miss Sands, the English teacher, accuses Maeve of plagiarising a paper, but encourages her to put her talent to better use. Jackson wins a swim meet, but is still pushed on by his mother to achieve greater things. Jackson is saddened to see that Maeve was not in attendance. After the abortion, Otis walks Maeve home, and they share a heartfelt hug."
      },
      {
        "EpisodeId": 3,
        "SeasonNumber": 1,
        "EpisodeNumber": 4,
        "Name": "Episode 4",
        "Description": "Maeve and Otis continue texting, while Jackson looks for ways to ask Maeve to be his girlfriend. Jackson approaches Otis for advice and pays him upfront; when Otis attempts to return the money, he unwittingly offers Jackson tips about Maeve's interests. Jackson uses the information to get closer to Maeve. Jean is attracted to the handyman Jakob, who has arrived to fix her bathroom. When Otis is carrying out research for lesbian clients (by watching lesbian porn), Jakob's daughter Ola walks in. Eric gets a job as a dogwalker but causes Adam's dog to run off at the park, landing Adam in trouble with his father. Lily asks Otis if he would like to have sex with her (as they are both virgins), but he declines. Otis has another session with his clients in the school swimming pool but doesn't make any progress. Afterwards, Maeve and Otis wind up playfighting in the pool, with Otis getting an erection that he hides from Maeve. When Jackson asks Otis for advice on how to ask Maeve out, he suggests a grand gesture in the hopes of sabotage. Jackson's grand gesture works, and Maeve agrees to be his girlfriend."
      },
      {
        "EpisodeId": 4,
        "SeasonNumber": 1,
        "EpisodeNumber": 5,
        "Name": "Episode 5",
        "Description": "Jackson invites Maeve over for dinner to meet his parents, as they have been dating for a month. The encounter starts going south when the parents enquire about Maeve's parents, so she sneaks out of the back door. Later, she apologises to Jackson and comes clean about her dysfunctional family, prompting Jackson to talk about his insecurities. Maeve and Otis try to find out who is disseminating a particularly embarrassing photo of one of their clients while Otis and Eric plan to attend Hedwig and the Angry Inch in full costume as part of their yearly tradition for Eric's birthday. In the process of solving the photo mystery, Otis stands Eric up. Eric's phone and wallet are stolen, and he is assaulted by two homophobes on the way home. He calls Jean and she picks him up; when Otis returns home, he and Eric get into a massive verbal fight, and both storm off."
      },
      {
        "EpisodeId": 5,
        "SeasonNumber": 1,
        "EpisodeNumber": 6,
        "Name": "Episode 6",
        "Description": "In a flashback, Otis catches his father Remi having sex with one of his patients, leading to his parents' divorce. Following his father's advice, Otis decides to take Lily up on her previous offer. During their session, Otis is incredibly awkward and has a panic attack when Lily's advances trigger his childhood memories. Eric, increasingly isolated, tries to dress more,normal. He winds up lashing out at the Swing Band instructor and punches out Anwar, resulting in suspension. His father tries to connect with Eric but is unsuccessful. Adam wins an essay-writing competition with an essay he had paid Maeve to write. Miss Sands correctly guesses that Maeve wrote the essay (as does Otis) and informs Mr Groff, who is already suspicious. Otis advises Aimee, who has a new boyfriend who insists that she dictate matters in bed. Jean, still infatuated with Jakob, manufactures a situation for him to come to her house and they become intimate. Maeve's brother Sean returns after having disappeared for several months; they reconcile after some tense moments. While trying to sort out his feelings for Maeve, Otis is caught off guard when Ola gives him her phone number and asks him out. He nervously accepts, unaware that Maeve has realised her own feelings for him."
      },
      {
        "EpisodeId": 6,
        "SeasonNumber": 1,
        "EpisodeNumber": 7,
        "Name": "Episode 7",
        "Description": "Maeve and Otis do not want to go to the school dance, but Jackson and Ola convince them otherwise. Maeve tries to sabotage Ola and Otis's relationship, but Ola is unaffected; when she tries to connect with Otis, he unwittingly insults her and she leaves. Imbued with newfound confidence, Eric goes to the dance in full drag, where he reconciles with Otis. At the dance, Otis's client Liam threatens to jump off a ledge but Otis is able to talk him down when he gives an impassioned speech about unrequited love; unbeknown to him, Maeve is left visibily shaken by his speech, and her reaction is noticed by Jackson. Afterwards, as Otis is telling Maeve that he feels responsible for the incident and wants to shut down their therapy business, Jackson drunkenly confesses that he paid Otis for tips on winning Maeve over. Heartbroken, Maeve angrily terminates both her partnership, and friendship with Otis, and storms off. Later, Jackson gets into a fight with his overbearing mother and returns to Maeve, professing his love for her. Adam gets into a physical altercation with his father, straining their already-troubled relationship. When Jakob opens up to Jean about his wish for a committed relationship, she turns him down due to Otis's concerns regarding his relationship with Ola. Otis finds her draft of a new book that details his sexual frustrations."
      },
      {
        "EpisodeId": 7,
        "SeasonNumber": 1,
        "EpisodeNumber": 8,
        "Name": "Episode 8",
        "Description": "Mr Groff finds the drugs that Sean sold at the dance and assumes Maeve and Otis are running a drug ring at school. He threatens to call the police, but Maeve takes responsibility, making her a candidate for expulsion. She defends herself in front of a tribunal, but the decision is deferred. Distraught after Maeve tells him she does not love him, Jackson starts skipping practice. He agrees to represent the school again if Maeve is reinstated, but the headmaster reneges on the deal. Eric and Adam are in detention; a physical altercation suddenly turns into sex. Their relationship is scuppered when Adam is shipped off to military school. Otis fights with Jean about her intrusiveness, but they later reconcile. Jean goes to tell Jakob she can no longer see him but ends up having sex with him again. Otis apologises to Ola; she accepts, then walks with him back to his house. Sean has disappeared. Maeve finds the essay prize Otis stole from the school office along with his note apologising to her. She goes to his house but sees him kissing Ola and leaves without them noticing. The kiss arouses Otis and he is finally able to masturbate."
      }
    ]
  }
]
